10. 2차원 리스트 생성과 접근

a=[0]*10
print(a)

a=[[0]*3 for _ in range(3)]
print(a)
#[[0, 0, 0], [0, 0, 0], [0, 0, 0]]

'''
          열
        0  1  2
      0 0  1  2
행    1 0  2  0
      2 0  0  0

'''
#2차원 리스트는 행열로 접근

a[0][1]=1
print(a)
#[[0, 1, 0], [0, 0, 0], [0, 0, 0]]

a[1][1]=2
print(a)
#[[0, 1, 0], [0, 2, 0], [0, 0, 0]]

for x in a:
    print(x)

'''
[0, 1, 0]
[0, 2, 0]
[0, 0, 0]
'''

for x in a:
    for y in x: #y는 리스트 x의 요소 하나하나에 접근
        print(y, end=' ')
    print()

'''
0 1 0 
0 2 0 
0 0 0
'''
